40 columns                              |
### Test how named arguments interact with block formatting.
>>> A function block argument can't be named.
function(name: () {;});
<<<
function(
  name: () {
    ;
  },
);
>>> A collection block argument can't be named.
function(name: [element, element, element, element]);
<<<
function(
  name: [
    element,
    element,
    element,
    element,
  ],
);
>>> If there are multiple functions, don't block format, even if only one is positional.
function(a: () {;}, () {;});
<<<
function(
  a: () {
    ;
  },
  () {
    ;
  },
);
>>> If there are multiple collections, don't block format, even if only one is positional.
function(a: [element], [element, element, element, element, element]);
<<<
function(
  a: [element],
  [
    element,
    element,
    element,
    element,
    element,
  ],
);
>>> Other non-block arguments can be named or not.
function(1, a: 2, 3, b: 4, [element, element], c: 5);
<<<
function(1, a: 2, 3, b: 4, [
  element,
  element,
], c: 5);