40 columns                              |
(trailing_commas preserve)
>>> Forces split with trailing comma and multiple positional fields.
var (x,y,) = rec;
<<<
var (
  x,
  y,
) = rec;
>>> Forces split with trailing comma and named field.
var (a:x,) = rec;
<<<
var (
  a: x,
) = rec;
>>> Doesn't force split with single positional field.
var (x,) = rec;
<<<
var (x,) = rec;
>>> Doesn't force split without trailing comma.
var (x,y,z) = rec;
<<<
var (x, y, z) = rec;
>>> May still split without trailing comma if doesn't fit.
var (element1, element2, element3, element4) = rec;
<<<
var (
  element1,
  element2,
  element3,
  element4,
) = rec;
